[{"id":"1","message":"","answers":[{"id":"1","message":"Hi, we've found out that you've hacked us.","short":"Warm welcome","correct":true,"trigger":"2"},{"id":"2","message":"You dirty criminals, we know it's you who've hacked us. We will find you, and we will expose you!","short":"Aggresive welcome","trigger":"3"}]},{"id":"2","message":"Hello. Thanks for contacting our support desk. We took all your files.","trigger":"4"},{"id":"3","message":"Hi, Haha, we did hack you and your ransom-price just doubled. You will never find us.","trigger":"4"},{"id":"4","message":"It is not the first time we've hacked an organization similar to you. We know we are currently talking to someone non-important, most probably from a security team. We only talk to your CEO or CFO. We are asking €2.000.000,- for you, to get back your data.","answers":[{"id":"1","message":"Right now our leadership is not available. For them to take this seriously, we need to make sure that you have actually gotten into our systems. Can you prove this by sharing some of our files, with us? If you can prove you are actually within our systems, leadership will consider talking to you.","short":"Can you please provide proof","trigger":"5","correct":true},{"id":"2","message":"Right now leadership is not available. They will never talk directly with you. Furthermore, they've already stated that they will never pay any ransom amount.","short":"Leadership will never talk with you, and we will never pay","trigger":"6"}]},{"id":"5","message":"We will send you some proof. Please ask your leadership to reconsider. Only we can give you access to your systems and files.  [ATTACHMENT1] [ATTACHMENT2] [ATTACHMENT3]","trigger":"7"},{"id":"6","message":"Then, we can only hope you have good backups.","trigger":"7"},{"id":"7","message":"We are not here for fun and games, we also have a reputation and good track record to keep. Which so far, we have! You can ask any of our previous customers. We always give back the files, and no longer keep our passwords your systems.","answers":[{"id":"1","message":"Our forensics team is familiar with your organization and know you are \"trustworthy\". Please give us some more time, leadership is in a meeting abroad, they are the only ones who can approve a deal like this. From our internal guidelines, we are only able to pay you €200.000,- for our data. Our leadership may be able to raise this amount by a couple of thousand euros.","short":"We trust you, give us more time","trigger":"8","correct":true},{"id":"2","message":"We will never trust you, and we don't care about your reputation. Our leadership is in a meeting abroad, they are the only ones who can approve a deal like this. From our internal guidelines, we are only able to pay you €200.000,- for our data. If you take this offer, we can do a deal right now.","short":"We don't trust you, here is a deal we can do right now","trigger":"9"}]},{"id":"8","message":"We will wait for you leadership. But, the price you are mentioning is not near enough. Another lowball like this and we will sell the data to the highest bidder on the Darkweb, on Milk Road. We know there will be a lot of demand for your data. I'm currently supporting another customer, similar to your organization, we are experiencing a full bidding war for their data on Milk Road.","answers":[{"id":"1","message":"We understand, but we do need our leadership involved, they will join as soon as possible. Then we still need more time to buy the crypto's you accept. What is a price you are willing to accept?","short":"Gain time and negotiate","trigger":"10","correct":true},{"id":"2","message":"We understand, we want to offer more, but this is all we can currently do. You've seen our financials, and you know we are currently experiencing financially hard times.","short":"Stop negotiating","trigger":"11"}]},{"id":"9","message":"We will never trust you. We need you to act now, the price you are mentioning is not near enough. Another lowball like this and we will sell the data to the highest bidder on the Darkweb, on Milk Road. We know there will be a lot of demand for your data. I'm currently supporting another customer, similar to your organization, we are experiencing a full bidding war for their data on Milk Road.","answers":[{"id":"1","message":"We understand, but we do need our leadership involved, they will join as soon as possible. Then we still need more time to buy the crypto's you accept. What is a price you are willing to accept?","short":"Gain time and negotiate","trigger":"10","correct":true},{"id":"2","message":"We understand, we want to offer more, but this is all we can currently do. You've seen our financials, and you know we are currently experiencing financially hard times.","short":"Stop negotiating","trigger":"11"}]},{"id":"10","message":"We need your leadership to act now.","trigger":"12"},{"id":"11","message":"We do not care about any sad stories. Do you want your data?","trigger":"12"},{"id":"12","message":"The minimum we need is €1.500.000,-. We will give you proof of deletion. We know this is important to our customers, and again, we have a reputation to keep up. This is our best and final offer.","answers":[{"id":"1","message":"We expect you will give us proof of deletion, we will require it for a deal. Please consider lowering your amount.","short":"Proof of deletion and further respectful negotiation","trigger":"14","correct":true},{"id":"2","message":"Thanks for lowering your price. To consider this price, we will need to see proof that you will delete the files after you've handed the files back to us. Furthermore we need proof that you will delete any password you have to our systems. Without this proof of deletion, we won't consider any price. Your current price is still too high for us.","short":"Proof of deletion and further aggresive negotiation","trigger":"13"}]},{"id":"13","message":"You are frustrating us by explaining, we've done this before, we know what you need! ","trigger":"14"},{"id":"14","message":"We will not lower the price, my boss is okay with selling your data on Milk Road.","answers":[{"id":"1","message":"Please, wait!","short":"Please, wait!","trigger":"15"},{"id":"2","message":"Please, we can go to €350.000,-","short":"Please, we can go to €350.000,-","trigger":"16"}]},{"id":"15","message":"No, time is out!","trigger":"17"},{"id":"16","message":"Still too low…!","trigger":"17"},{"id":"17","message":"You can now find your data on Milk Road. To now get back your data, you have to be the highest bidder. Good Luck! This will be a lot more than our offers! You will see a export of your active directory, with probably your own personal data being sold. Here's the link to the live auction: [MILKROAD]"}]
